------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\cla-spa206.CAMPUS-DOMAIN\Downloads\lab2.log
  log type:  text
 opened on:   5 Feb 2013, 11:48:30

. //b.Imports the BEA data from your flash drive
> insheet using "Farm SE 7000 BEA.csv", names;
(34 vars, 3140 obs)

. local i = 1969;

. foreach v of varlist v*{;
  2.         local i = `i'+1;
  3.         rename `v' farmse`i';
  4. };

. foreach v of varlist fips farmse* {;
  2.         gen `v'_new=real(`v');
  3.         drop `v';
  4.         rename `v'_new `v';
  5.         };
(5 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(31 missing values generated)
(37 missing values generated)
(37 missing values generated)
(37 missing values generated)
(36 missing values generated)
(35 missing values generated)
(35 missing values generated)
(35 missing values generated)
(35 missing values generated)
(35 missing values generated)
(34 missing values generated)
(33 missing values generated)
(33 missing values generated)
(31 missing values generated)
(31 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)
(30 missing values generated)

.         //label variable <name> <"label">
> label variable areaname "county and state";

. label variable farmse1970 "farm self employment 1970";

. label variable farmse2000 "farm self employment 2000";

. twoway scatter farmse1970 farmse2000;

. graph export scatter.emf, replace;
(file C:\Users\cla-spa206.CAMPUS-DOMAIN\Downloads\scatter.emf written in Enhan
> ced Metafile format)

. twoway (lfit farmse1970 farmse2000)(scatter farmse1970 farmse2000);

. graph export scatter2.emf, replace;
(file C:\Users\cla-spa206.CAMPUS-DOMAIN\Downloads\scatter2.emf written in Enha
> nced Metafile format)

. //calculate tstat manually
> sum farmse1970;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  farmse1970 |      3109    884.8504    725.8694          0       8534

. scalar tstat = (r(mean) - 800)/(r(sd) / sqrt(r(N)));

. //create pval by manually - sca is short for scalar
> sca pval = ttail(r(N),tstat);

. //now use ttest 
> ttest farmse1970==800;

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
far~1970 |    3109    884.8504    13.01812    725.8694    859.3255    910.3754
------------------------------------------------------------------------------
    mean = mean(farmse1970)                                       t =   6.5179
Ho: mean = 800                                   degrees of freedom =     3108

   Ha: mean < 800               Ha: mean != 800               Ha: mean > 800
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. //always use unpaired unequal
> ttest farmse1970= farmse2000, unpaired unequal;

Two-sample t test with unequal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
far~1970 |    3109    884.8504    13.01812    725.8694    859.3255    910.3754
far~2000 |    3110    719.2926    10.38933    579.3855     698.922    739.6632
---------+--------------------------------------------------------------------
combined |    6219    802.0582    8.392752    661.8578    785.6055    818.5109
---------+--------------------------------------------------------------------
    diff |            165.5578    16.65561                132.9068    198.2089
------------------------------------------------------------------------------
    diff = mean(farmse1970) - mean(farmse2000)                    t =   9.9401
Ho: diff = 0                     Satterthwaite's degrees of freedom =  5925.06

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. log close;
      name:  <unnamed>
       log:  C:\Users\cla-spa206.CAMPUS-DOMAIN\Downloads\lab2.log
  log type:  text
 closed on:   5 Feb 2013, 11:48:31
------------------------------------------------------------------------------
